{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"activation": "linear", "dim_ordering": "tf", "input_dtype": "float32", "nb_col": 5, "border_mode": "valid", "b_constraint": null, "bias": true, "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_1", "batch_input_shape": [null, 66, 200, 3], "subsample": [2, 2], "activity_regularizer": null, "nb_row": 5, "b_regularizer": null, "W_regularizer": null, "nb_filter": 24, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "dim_ordering": "tf", "nb_col": 5, "border_mode": "valid", "b_constraint": null, "bias": true, "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_2", "trainable": true, "activity_regularizer": null, "nb_row": 5, "b_regularizer": null, "W_regularizer": null, "nb_filter": 36, "subsample": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "dim_ordering": "tf", "nb_col": 5, "border_mode": "valid", "b_constraint": null, "bias": true, "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_3", "trainable": true, "activity_regularizer": null, "nb_row": 5, "b_regularizer": null, "W_regularizer": null, "nb_filter": 48, "subsample": [2, 2]}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "dim_ordering": "tf", "nb_col": 3, "border_mode": "valid", "b_constraint": null, "bias": true, "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_4", "trainable": true, "activity_regularizer": null, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "nb_filter": 64, "subsample": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "dim_ordering": "tf", "nb_col": 3, "border_mode": "valid", "b_constraint": null, "bias": true, "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_5", "trainable": true, "activity_regularizer": null, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "nb_filter": 64, "subsample": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 100, "b_constraint": null, "bias": true, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "name": "dense_1", "b_regularizer": null, "W_regularizer": null, "input_dim": 1152, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 50, "b_constraint": null, "bias": true, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "name": "dense_2", "b_regularizer": null, "W_regularizer": null, "input_dim": 100, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 10, "b_constraint": null, "bias": true, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "name": "dense_3", "b_regularizer": null, "W_regularizer": null, "input_dim": 50, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 1, "b_constraint": null, "bias": true, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "name": "dense_4", "b_regularizer": null, "W_regularizer": null, "input_dim": 10, "activation": "linear"}}]}