{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_col": 5, "activation": "linear", "activity_regularizer": null, "batch_input_shape": [null, 66, 200, 3], "nb_filter": 24, "subsample": [2, 2], "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_1", "trainable": true, "border_mode": "valid", "input_dtype": "float32", "W_regularizer": null, "bias": true, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "nb_row": 5}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "activation": "linear", "activity_regularizer": null, "nb_filter": 36, "subsample": [2, 2], "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_2", "trainable": true, "border_mode": "valid", "bias": true, "W_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "nb_row": 5}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.25, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "activation": "linear", "activity_regularizer": null, "nb_filter": 48, "subsample": [2, 2], "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_3", "trainable": true, "border_mode": "valid", "bias": true, "W_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "nb_row": 5}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "activation": "linear", "activity_regularizer": null, "nb_filter": 64, "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_4", "trainable": true, "border_mode": "valid", "bias": true, "W_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "nb_row": 3}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "activation": "linear", "activity_regularizer": null, "nb_filter": 64, "subsample": [1, 1], "b_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_5", "trainable": true, "border_mode": "valid", "bias": true, "W_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "nb_row": 3}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "input_dim": 1152, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "output_dim": 100, "bias": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "input_dim": 100, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "output_dim": 50, "bias": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "dense_2"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "input_dim": 50, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "output_dim": 10, "bias": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "dense_3"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "input_dim": 10, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "output_dim": 1, "bias": true, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "dense_4"}}], "keras_version": "1.2.1"}