{"keras_version": "1.2.1", "config": [{"config": {"nb_row": 5, "trainable": true, "dim_ordering": "tf", "nb_filter": 24, "name": "convolution2d_1", "W_constraint": null, "nb_col": 5, "b_regularizer": null, "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "subsample": [2, 2], "activation": "linear", "bias": true, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"nb_row": 5, "trainable": true, "dim_ordering": "tf", "nb_filter": 36, "name": "convolution2d_2", "W_constraint": null, "nb_col": 5, "subsample": [2, 2], "b_regularizer": null, "activation": "linear", "bias": true, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.25}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"nb_row": 5, "trainable": true, "dim_ordering": "tf", "nb_filter": 48, "name": "convolution2d_3", "W_constraint": null, "nb_col": 5, "subsample": [2, 2], "b_regularizer": null, "activation": "linear", "bias": true, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"nb_row": 3, "trainable": true, "dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_4", "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "b_regularizer": null, "activation": "linear", "bias": true, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"nb_row": 3, "trainable": true, "dim_ordering": "tf", "nb_filter": 64, "name": "convolution2d_5", "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "b_regularizer": null, "activation": "linear", "bias": true, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_5", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "W_regularizer": null, "W_constraint": null, "name": "dense_1", "init": "glorot_uniform", "input_dim": 1152, "b_regularizer": null, "activation": "linear", "bias": true, "b_constraint": null, "activity_regularizer": null, "output_dim": 100}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_6", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "W_regularizer": null, "W_constraint": null, "name": "dense_2", "init": "glorot_uniform", "input_dim": 100, "b_regularizer": null, "activation": "linear", "bias": true, "b_constraint": null, "activity_regularizer": null, "output_dim": 50}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_7", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "W_regularizer": null, "W_constraint": null, "name": "dense_3", "init": "glorot_uniform", "input_dim": 50, "b_regularizer": null, "activation": "linear", "bias": true, "b_constraint": null, "activity_regularizer": null, "output_dim": 10}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_8", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "W_regularizer": null, "W_constraint": null, "name": "dense_4", "init": "glorot_uniform", "input_dim": 10, "b_regularizer": null, "activation": "linear", "bias": true, "b_constraint": null, "activity_regularizer": null, "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential"}